text = """Тонкие и толстые сплошные линии
─
2500
Граница легкая горизонтальная
━
2501
Граница жирная горизонтальная
│
2502
Граница легкая вертикальная
┃
2503
Граница жирная вертикальная
Тонкие и толстые пунктирные линии
┄
2504
Граница легкое тройное тире горизонтальное
┅
2505
Граница жирное тройное тире горизонтальное
┆
2506
Граница легкое тройное тире вертикальное
┇
2507
Граница жирное тройное тире вертикальное
┈
2508
Граница легкое четверное тире горизонтальное
┉
2509
Граница жирное четверное тире горизонтальное
┊
250A
Граница легкое четверное тире вертикальное
┋
250B
Граница жирное четверное тире вертикальное
Тонкие и толстые компоненты рамок и таблиц
┌
250C
Граница легкая вниз в направо
┍
250D
Граница легкая вниз и жирная направо
┎
250E
Граница жирная вниз и легкая направо
┏
250F
Граница жирная вниз и направо
┐
2510
Граница легкая вниз и налево
┑
2511
Граница легкая вниз и жирная налево
┒
2512
Граница жирная вниз и легкая налево
┓
2513
Граница жирная вниз и налево
└
2514
Граница легкая вверх и направо
┕
2515
Граница легкая вверх и жирная направо
┖
2516
Граница жирная вверх и легкая направо
┗
2517
Граница жирная вверх и направо
┘
2518
Граница легкая вверх и налево
┙
2519
Граница легкая вверх и жирная налево
┚
251A
Граница жирная вверх и легкая налево
┛
251B
Граница жирная вверх и налево
├
251C
Граница легкая вертикальная и направо
┝
251D
Граница легкая вертикальная и жирная направо
┞
251E
Граница жирная вверх и легкая направо и вниз
┟
251F
Граница жирная вниз и легкая направо и вверх
┠
2520
Граница вертикальная жирная и легкая направо
┡
2521
Граница легкая вниз жирная направо и вверх
┢
2522
Граница легкая вверх и жирная направо и вниз
┣
2523
Граница жирная вертикальная и направо
┤
2524
Граница легкая вертикальная и налево
┥
2525
Граница легкая вертикальная и жирная налево
┦
2526
Граница жирная вверх и легкая налево и вниз
┧
2527
Граница жирная вниз и легкая вверх и налево
┨
2528
Граница жирная вертикальная и легкая налево
┩
2529
Граница легкая вниз и жирная вверх и налево
┪
252A
Граница легкая вверх и жирная налево и вниз
┫
252B
Граница жирная вертикальная и налево
┬
252C
Граница легкая вниз и горизонтально
┭
252D
Граница жирная налево и легкая направо и вниз
┮
252E
Граница жирная направо и легкая налево и вниз
┯
252F
Граница легкая вниз и жирная горизонтально
┰
2530
Граница жирная вниз и легкая горизонтально
┱
2531
Граница легкая направо и жирная налево и вниз
┲
2532
Граница легкая налево и жирная направо и вниз
┳
2533
Граница жирная вниз и горизонтально
┴
2534
Граница легкая вверх и горизонтально
┵
2535
Граница жирная налево легкая направо и вниз
┶
2536
Граница жирная направо и легкая налево и вверх
┷
2537
Граница легкая вверх и жирная горизонтально
┸
2538
Граница жирная вверх и легкое горизонтально
┹
2539
Граница легкая направо и жирная налево и вверх
┺
253A
Граница легкая налево и жирная вверх и направо
┻
253B
Граница жирная вверх и горизонтально
┼
253C
Граница легкая вертикальная и горизонтальная
┽
253D
Граница жирная налево легкая вертикально и направо
┾
253E
Граница жирная направо легкая вертикально и налево
┿
253F
Граница легкая вертикальная жирная горизонтальная
╀
2540
Граница жирная вверх легкая горизонтально и вниз
╁
2541
Граница жирная вниз легкая горизонтально и вверх
╂
2542
Граница жирная вертикально легкая горизонтально
╃
2543
Граница жирная вверх и налево легкая вниз и направо
╄
2544
Граница жирная вверх и направо легкая вниз и налево
╅
2545
Граница жирная вниз и налево легкая вверх и направо
╆
2546
Граница жирная вниз и направо легкая вверх и налево
╇
2547
Граница легкая вниз жирная горизонтально и вверх
╈
2548
Граница легкая вверх жирная вниз горизонтально
╉
2549
Граница легкая направо жирная вертикально и налево
╊
254A
Граница легкая налево жирная вертикально и направо
╋
254B
Граница жирная вертикально и горизонтально
Тонкие и толстые пунктирные линии
╌
254C
Граница легкое двойное горизонтальное тире
╍
254D
Граница жирное двойное горизонтально тире
╎
254E
Граница легкое двойное вертикальное тире
╏
254F
Граница жирное двойное вертикальное тире
Двойные линии
═
2550
Граница двойная горизонтальная
║
2551
Граница двойная вертикальная
╭
256D
Граница легкая дуга вниз и направо
╮
256E
Граница легкая дуга вниз и налево
╯
256F
Граница легкая дуга вверх и вверх и налево
╰
2570
Граница легкая дуга вверх и направо
Тонкие и толстые половинки линий
╴
2574
Граница легкая слева
╵
2575
Граница легкая вверх
╶
2576
Граница легкая направо
╷
2577
Граница легкая вниз
╸
2578
Граница жирная налево
╹
2579
Граница жирная вверх
╺
257A
Граница жирная направо
╻
257B
Граница жирная вниз
Линии смешанной толщины
╼
257C
Граница легкая налево и жирная направо
╽
257D
Граница легкая вверх и жирная вниз
╾
257E
Граница жирная налево и легкая направо
╿
257F
Граница жирная вверх и легкая вниз"""

for i in text.split('\n'):
    if i.split(' ')[0] in ['Тонкие', 'Линии', 'Дуги']:
        continue # types descriptions
    if len(i)  == 1:
        print(f"Symbol('{i}'", end="") # Symbols
        continue
    if len(i) == 4:
        continue # Codes
    if i.split(' ')[0] == 'Граница':
        is_weight = False
        for word in i.split(' ')[1:]:
            if word == 'легкая':
                is_weight =False
            elif word == 'жирная':
                is_weight = True
            elif word == "налево":
                print(f", left={is_weight}", end = "")
            elif word == "направо":
                print(f", right={is_weight}", end="")
            elif word == "вверх":
                print(f", top={is_weight}", end="")
            elif word == 'вниз':
                print(f", bottom={is_weight}", end="")
            elif word == 'дуга':
                print(", is_arc=True", end="")
            elif word == 'двойная':
                print("is_duble=True", end="")
            elif word == 'тире':
                print(", is_dash=True", end="")
            elif word == "и":
                pass
        print("),")



